angular.module('starter.services', [])

.factory('places', function() {
  // Might use a resource here that returns a JSON array

  // Some fake testing data
  var places = [{
    id: 0,
    name: 'حسینیه امینی‌ها',
    lastText: 'خانه و حسینیه امینی‌ها، از خانه‌های زیبا و اعیانی است که توسط حاج محمد رضا امینی از اعیان تجارقزوین در غرب رودخانه دزج ساخته شد که بعدها در زمان پهلوی اول رودخانه پر شده و خیابان مولوی به جای آن احداث گردید. این ساختمان در سال ۱۲۷۵ هجری قمری بنا گردیده و در آن وقت مبلغ چهل و هشت هزار تومان صرف ساخت آن شده‌است. در میان بنا سه تالار ساخته شده که امتداد آن‌ها به موازات یکدیگر از شرق به غرب ا ست و میان دو حیاط شمالی و جنوبی قرار دارد. تالارها دارای ارسی های بسیار زیبایی بوده که در هنگام روضه خوانی با بلند کردن آن‌ها، هر سه تالار یکی می‌گردند و محوطه سر پوشیده بزرگ و آیینه کاری زیبایی تشکیل می‌دهند. در وسط تالار بزرگ چهلچراغ آویخته شده و فرشهای تالار یکتخته و عتیقه بوده‌است. زیر تالارها خالی بوده و سردابه، زیرزمین، شربتخانه و انبار ساخته‌اند. مرحوم حاج محمد رضای امینی برای خیرات و مبرات در سال ۱۳۰۳ ه.ق دهاتی را جهت روضه خوانی در ایام محرم و اطعام مساکین در محرم و صفر و رمضان وقف این حسینیه نموده‌است.',
    face: 'img/p0.jpg'

  }, {
    id: 1,
    name: 'قلعه الموت',
    lastText: 'قلعه الموت یکی از قلعه‌های منحصربه‌ فرد تاریخی در ایران است. دژ الموت در شمال شرقی روستای گازرخان (قصر خان) و بر فراز صخره‌ای به ارتفاع ۲۱۶۳ متر از سطح دریا که بلندی صخره از زمین‌های پیرامون خود ۲۰۰ متر و گسترده دژ ۲۰۰۰۰ متر مربع می‌باشد قرار دارد. این کوه از نرمه گردن (میانه نرمه‌لات و گرمارود) شروع شده و به طرف غرب ادامه پیدا کرده است. صخره‌های پیرامون قلعه که رنگ سرخ و خاکستری دارند، در جهت شمال شرقی به جنوب غربی کشیده شده‌اند. پیرامون دژ از هر چهار سو پرتگاه است و تنها راه ورود به قلعه در انتهای ضلع شمال شرقی است که کوه هودکان با فاصله‌ای نسبتاً زیاد بر آن مشرف است. قلعه الموت را مردم محل «قلعه حسن» می‌نامند. این قلعه از دو بخش غربی و شرقی تشکیل شده است. قسمت باختری که دارای ارتفاع بیش‌تری است به نام جورقلا (یعنی قلعه بالا) و پیلاقلا (یعنی قلعه بزرگ) خوانده می‌شود. ین قلعه در شوال ۶۵۴ هجری قمری به دستو هلاکو به آتش کشیده و ویران شد و از آن پس به‌عنوان تبعید گاه و زندان مورد استفاده قرار گرفت. همچنین از سال ۹۳۰ هجری قمری و ابتدای حکومت شاه تهماسب صفوی تا سال ۱۰۰۶ هجری قمری قلعه کالبدی سالم داشته است. متأسفانه حفاری‌هایی که در دوره قاجار برای یافتن گنج در قلعهٔ الموت انجام شده، سبب ویرانی آن شده‌است.' ,
    face: 'img/p1.jpg'
  }, {
    id: 2,
    name: 'دریاچه اوان',
    lastText: 'دریاچه زیبای اوان در نیمه شمالی الموت، در دامنه کوه خشچال در فاصله ۷۵ کیلومتری قزوین و در میان چهار روستای اوان، وربن، زواردشت و زرآبادشهر قزوین قرار دارد. این دریاچه ۸۹اُمین اثر طبیعی است که توسط سازمان میراث فرهنگی در ۲۰ بهمن ۱۳۸۹ در فهرست میراث طبیعی ایران قرار گرفت.اوان که بیش از هفتاد هزار متر مربع مساحت دارد، در ارتفاع هزار و هشتصد و پانزده متری از سطح دریا واقع شده‌است. طول آن در طویل‌ترین قسمت ۳۲۵ متر و عرض آن ۲۷۵ متر می‌باشد. عمیق‌ترین بخش آن که توسط یک تیم غواصی در ۱۸ مرداد ماه سال ۹۲ با استفاده از دو دستگاه دایو کامپیوتر سوانتو اندازه‌ گیری شده است ۶٫۸ متر با دمای آب ۲۳ درجه سانتیگراد و میدان دید در زیر آب کمتر از یک متر می‌باشد که در جنوب شرقی آن واقع شده‌ است البته برخی از مردم محلی عمق‌های متفاوتی را برای این دریاچه عنوان نموده‌اند که تیم غواصی چنین چیزی را تایید نکرد. بستر دریاچه مملو از لجن و رسوبات ته‌نشین شده می‌باشد که حالت چسبندگی بسیاری دارد. از سرریز آب دریاچه نیز رود کوچکی تشکیل می‌شود که آب آن مورد استفاده کشاورزان روستاهای کوشک و آیین است.',
    face: 'img/p2.png'
  }, {
    id: 3,
    name: 'عمارت چهل ستون',
    lastText: 'عمارت چهل ستون قزوین معروف به عمارت کلاه فرنگی بنایی در شهر قزوین است. این بنا که تنها کوشک باقی‌مانده از مجموعه کاخ‌های سلطنتی روزگار شاه تهماسب می باشد، در مرکز شهر قزوین و در میدان آزادی (سبزه میدان) قرار دارد و در دوره صفویه و زمانی که قزوین پایتخت بود به کلاه فرنگی مشهور بود. عمارت چهلستون ساختمانی هشت گوش و در دوطبقه به مساحت تقریبی ‎ ۵۰۰مترمربع بنا شده‌است. رواقی با ستونهای آجری و قوسهای نیم دایره‌ای بنا را در برگرفته و بر بالای آن ایوانی با ستونهای چوبی استوار گردیده‌است. نقشه بنا دارای طرحی با محورهای صلیبی و برون گرا و سقف طبقه همکف پوشیده از مقرنس با طرح‌های بدیع و سقف طبقه فوقانی خنچه پوش است. این کاخ در سال ۱۳۳۷ به عنوان گنجینه اشیای تاریخی و باستانی مورد استفاده قرار گرفت و هم اکنون به موزه خوشنویسی قزوین تبدیل شده‌است.',
    face: 'img/p3.jpg'
  }, {
    id: 4,
    name: 'مسجد النبی ',
    lastText: 'مسجد النبی معروف به مسجد سلطانی مسجدی در شهر است. در این مسجد که مساحتی قریب به ۱۴۰۰۰ متر مربع دارد، کتیبه‌هایی یافت شده که بر طبق آن فتحعلیشاه قاجار بانی مسجد ثبت گردیده اما شواهدی دال بر وجود مسجد در دوران صفوی نیز موجود است. معمار بنا را شخصی بنام استاد میرزای شیرازی دانسته‌اند و سال بنا را ۱۱۶۶ هجری شمسی. گنبد مسجد دو پوسته و صحن مسجد چهار ایوانیست. این مسجد، همانند مسجد جامع قزوین دارای شبستانی است که محل گردهمایی نمازگزاران در هر جمعه برای اقامه نماز جمعه می‌باشد.',
    face: 'img/p4.jpg'
  }, {
    id: 5,
    name: 'دروازه درب کوشک',
    lastText: 'یکی از کهن ترین دروازه های شهر قزوین است که به سوی الموت، رودبار و کوشک ها و شکارگاه های شمال قزوین باز می شده است و دارای یک ورودی با قوس و کلیل و نیم دایره است. در هر طرف راهرو دو طاق نما ساخته شده که با نرمی به سوی بیرون پیش آمده و حالت آغوش گشوده را تداعی می کند. این دروازه تنها یک نما به سوی خارج شهر دارد که از تزیینات کاشی کاری و رسمی بندی برخوردار است و بدنه روبه داخل آن، آجری ساده است. کاشی کاری موجود در بنا در زمان فرمانروایی عضدالملک قاجار انجام شده است. شهر قزوین در گذشته نه دروازه به نام های درب کوشک ( در شمال شرقی)، دروازه ی شیخ آباد در خیابان سعدی ( در شمال غربی )، دروازه ی رشت، دروازه مغلاوک یا دروازه همدان ( در جنوب غربی)، دروازه ی خندقبار، دروازه ساوالان، دروازه ی راه ری، دروازه تهران، دروازه پنبه ریسه (در شرق خیابان طالقانی فعلی) داشته است که امروزه از آن میان، تنها دو دروازه درب کوشک و تهران قدیم باقی‌مانده اند.',
    face: 'img/p5.jpg'
  }, {
    id: 6,
    name: 'موزه قزوین',
    lastText: 'موزه قزوین در شرق دولتخانه صفوی قزوین قرار دارد. اشیای این موزه به چند گروه تقسیم می‌شوند. برخی از این اشیاء که بیشتر ظروف سفالی و اشیای مفرغی است، به هزاره‌های سوم و اول پیش از میلاد تعلق دارند. سایر اشیای این موزه مربوط به دوران اسلامی از قرون اولیه تا عهد معاصر است. یکی از جذابیت‌های این موزه به دلیل داشتن مهره‌های آن است.',
    face: 'img/p6.jpg'
  }, {
    id: 7,
    name: 'سردر عالی قاپو',
    lastText: 'سردر عالی قاپو یکی از آثار تاریخی و گردشگری در شهر قزوین است که در ابتدای خیابان سپه – نخستین خیابان ساخته شده در ایران – قرار دارد. این بنا سردر یکی از هفت در ورودی به ارگ سلطنتی صفویان بوده است. در اصلی، جنوبی است که به خیابان و میدان شاه باز می‌شده و تنها در از این مجموعه است که اکنون به یادگار مانده است. این سردر، ورودی اصلی به دولتخانه دوران صفویه بود. بنای سر در شامل ایوان رفیع ورودی با قوس تیزه ‌دار و سه ریف طاق‌نما در طرفین آن است. گوشواره‌هایی با ستون ‌نماهای آجری در دو طبقه، نمای سردر را تکمیل می‌کنند. هشتی متصل به ایوان ورودی به شکل هشت ضلعی است و در طرفین محور ورودی آن اتاق‌های نگهبانی قرار دارد. در این هشتی پلکان‌هایی دیده می‌شود که به طبقه بالا - جایگاه نقاره‌زنان - راه می‌یابند. کتیبه و شباک کاشی، تنها تزیینات باقی‌مانده در ایوان ورودی است. سردر عالی قاپو قبل از انقلاب، جایگاه شهربانی و سپس در اختیار نیروی انتظامی بود، اکنون در اختیار میراث فرهنگی قرار گرفته و به منظور احیای دولتخانه صفوی در در حال مرمت می باشد.',
    face: 'img/p7.jpg'
  },{
    id: 8,
    name: 'امامزاده حسین',
    lastText: 'امامزاده شاهزاده حسین فرزند علی بن موسی الرضا است که مقبره‌اش در شهر قزوین واقع شده‌است. گفته شده که شاهزاده حسین در سفر به مرو حین عبور از قزوین، در این شهر درگذشت و در همانجا به خاک سپرده شد. بقعه شاهزاده حسین با دو ورودی از سمت شمال و جنوب در میان صحن بزرگی قرار گرفته‌است. در اطراف صحن ایوان‌هایی وجود دارد که با کاشی کاری در طرحهای مختلف تزیین شده‌است. ورودی بقعهٔ شاهزاده حسین دارای مقرنس کاری و تزیینات مختلف است، که در دورهٔ قاجاریه با افزودن تالاری به آن شکل تازه‌ای یافته‌است. در بخش غربی و شرقی بقعه، دو رواق ساخته شده که به نامهای بالا سر و پایان پا معروف و دارای گچ بری و کاشی کاری است. فضای داخل بقعه شاهزاده حسین، باکاشی خشتی هفت رنگ، بدنهٔ آن با آیینه کاری و زیر گنبد باکتیبه‌هایی به خط ثلث در زمینهٔ لاجوردی تزیین شده‌است. قدیمی ترین و زیباترین اثر مجموعه شاهزاده حسین، در چوبی منبت کاری شدهٔ آن است که در سال ۹۶۷ هجری به مجموعه اضافه شده‌است. طبق کتیبه‌ای از کاشی معرق، این مجموعه در سال ۱۰۴۰ هجری به دستور زینب بیگم، دختر شاه طهماسب صفوی، بازسازی و صندوق چوبی نفیسی بر مزار آن نصب شده‌است.',
    face: 'img/p8.jpg'
  }, {
    id: 9,
    name: 'پیغمبریه',
    lastText: 'پیغمبریه مربوط به دوره ی صفوی است و در قزوین، جانب شرقی خیابان پیغمبریه و جنب مدرسه و مسجد پیغمبریه در غرب بنای چهل ستون قرار دارد و تاریخ ساخت بنا به دوران صفویه برمی گردد که در ادوار بعدی بازسازی و تکمیل گشته است و در سردر ورودی حیاط کتیبه‌ای وجود دارد که تاریخ اتمام بنا 1332 ذکر می نماید. این مکان را آرامگاه چهارتن از پیامبران بنی اسرائیل به نام های: سهولی، سلام، القیا و سلوم می دانند و به " چهار انبیاء " نیز معروف می باشد که گفته می شود آنان پیامبرانی می باشند که مژده میلاد مسیح را از اورشلیم به سوی شرق آورده بودند و از اسناد مـوقــوفات صفویه برمی آید که این مکان در پایان قرن یازدهم هجری زیارتگاهی مورد احترام بوده و باغ هــایی را بر آن وقـف کـرده اند. بنای فعلی پیغمبریه از آثار میرزا مسعود شیخ الاسلام می باشد. حرم در چهار جهت دارای چهار شاه نشین است و طرح آن در داخل به صورت بیست ضلعی است. در چهار جانب حرم چهار قوس بلند برپا گردیده که به کمک فیلپوش ها، طاق حرم را نگاه داشته اند. از جایی که قوس ها آغاز شده، دور تا دور حرم کتیبه ای گچ بری شده از سوره جمعه با رنگ طلایی روی زمینه لاجوردی به خط نسخ توسط مرحوم شیخ علی سکاکی نوشته شده که از جمله آثار هنری بقعه به شمار می رود لازم به ذکر است، علاوه بر چهار پیامبر نامبرده، مقبره امامزاده صالح بن حسن مجتبی (ع) را نیز در همین مکان می باشد.',
    face: 'img/p9.jpg'
  },{
    id: 10,
    name: 'کاروان‌سرای سعدالسلطنه',
    lastText: 'کاروان‌سرای سعدالسلطنه به دستور (سعدالسلطنه) حاکم وقت قاجاریه قزوین ساخته شد. ارزشمندترین قسمت این بنا، چهار سوق آن است که از تقاطع قائم دو راسته ایجاد شده و بر فراز آن گنبد بزرگ کاشی کاری شده‌ای قرار دارد. چهار طرف گنبد را، چهار نیم‌گنبد با رسمی‌بندی و نورگیر فراگرفته‌اند که فضا را بزرگتر نشان می‌دهند. سرای سعدالسلطنه قزوین بزرگترین کاروانسرای سرپوشیده و مرکزتجاری داخلی شهری کشور است که با وسعتی افزون بر ۶/۲ هکتار در اواخر سلطنت ناصرالدین شاه قاجار ساخته شد. عملیات مرمت این مجموعه نیز در قالب تفاهم‌نامه از طریق صندوق احیا و بهره ‌برداری از اماکن تاریخی و فرهنگی سازمان میراث‌ فرهنگی به سازمان بهسازی و نوسازی شهرداری قزوین واگذار شد و عملیات اجرایی مرمت ادامه دارد و این بنا روند مطلوبی را در حوزه مرمت و بازسازی طی می‌کند. عملیات مرمت با استفاده از منابع مالی سازمان بهسازی و نوسازی و زیر نظر سازمان میراث فرهنگی، صنایع دستی و گردشگری در دست انجام است و در حال حاضر بسیاری از قسمت ها بنا مرمت شده اند قرار است قسمت های مرمت شده به زودی توسط متولی آن به کاربری هایی مانند رستوران، تولیدی و فروشگاه لباس و … اجاره داده شود',
    face: 'img/p10.jpg'
  },
  ];

  return {
    all: function() {
      return places;
    },
    get: function(placeId) {
      for (var i = 0; i < places.length; i++) {
        if (places[i].id === parseInt(placeId)) {
          return places[i];
        }
      }
      return null;
    }
  };
});
